Ran Plan for dir: `terragrunt/kubernetes/renovate` workspace: `terragrunt_kubernetes_renovate`

<details><summary>Show Output</summary>

```diff
Authenticated

01:00:49.894 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/-3xP2Z-8YcMu0XIqQxf9fpu_UQM/3NgaM4dsoJ8T1LekQ3KP6FBfO0E
01:00:49.920 INFO   tofu: Initializing the backend...
01:00:50.198 INFO   tofu: Initializing provider plugins...
01:00:50.198 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:00:50.363 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:00:50.450 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:00:50.562 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:00:50.654 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:00:50.739 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:00:50.870 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:00:50.979 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:00:51.089 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:00:51.168 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:00:51.189 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:00:51.200 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:00:51.234 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:00:51.270 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:00:51.292 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.8.1
01:00:51.329 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:00:51.329 INFO   tofu: OpenTofu has been successfully initialized!
01:00:52.018 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:00:52.018 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:00:52.018 STDOUT tofu:   ~ update in-place
01:00:52.018 STDOUT tofu: OpenTofu will perform the following actions:
01:00:52.019 STDOUT tofu:   # helm_release.renovate will be updated in-place
01:00:52.019 STDOUT tofu:   ~ resource "helm_release" "renovate" {
01:00:52.019 STDOUT tofu:       ~ id                         = "renovate" -> (known after apply)
01:00:52.019 STDOUT tofu:       ~ metadata                   = {
01:00:52.019 STDOUT tofu:           ~ app_version    = "43.5.4" -> (known after apply)
01:00:52.019 STDOUT tofu:           ~ chart          = "renovate" -> (known after apply)
01:00:52.019 STDOUT tofu:           ~ first_deployed = 1746674676 -> (known after apply)
01:00:52.019 STDOUT tofu:           ~ last_deployed  = 1770686125 -> (known after apply)
01:00:52.019 STDOUT tofu:           ~ name           = "renovate" -> (known after apply)
01:00:52.019 STDOUT tofu:           ~ namespace      = "renovate" -> (known after apply)
01:00:52.019 STDOUT tofu:           ~ revision       = 75 -> (known after apply)
01:00:52.019 STDOUT tofu:           ~ values         = jsonencode(
01:00:52.019 STDOUT tofu:                 {
01:00:52.020 STDOUT tofu:                   - envFrom  = [
01:00:52.020 STDOUT tofu:                       - {
01:00:52.020 STDOUT tofu:                           - secretRef = {
01:00:52.020 STDOUT tofu:                               - name = "renovate-env"
01:00:52.020 STDOUT tofu:                             }
01:00:52.020 STDOUT tofu:                         },
01:00:52.020 STDOUT tofu:                     ]
01:00:52.020 STDOUT tofu:                   - renovate = {
01:00:52.020 STDOUT tofu:                       - config = jsonencode(
01:00:52.020 STDOUT tofu:                             {
01:00:52.020 STDOUT tofu:                               - gitAuthor    = "YouHide Renovate Bot <youhide_renovate@none.com>"
01:00:52.020 STDOUT tofu:                               - platform     = "github"
01:00:52.020 STDOUT tofu:                               - repositories = [
01:00:52.020 STDOUT tofu:                                   - "youhide/hideForming",
01:00:52.020 STDOUT tofu:                                 ]
01:00:52.020 STDOUT tofu:                             }
01:00:52.020 STDOUT tofu:                         )
01:00:52.020 STDOUT tofu:                     }
01:00:52.020 STDOUT tofu:                 }
01:00:52.020 STDOUT tofu:             ) -> (known after apply)
01:00:52.020 STDOUT tofu:           ~ version        = "46.6.4" -> (known after apply)
01:00:52.020 STDOUT tofu:         } -> (known after apply)
01:00:52.020 STDOUT tofu:         name                       = "renovate"
01:00:52.020 STDOUT tofu:       ~ version                    = "46.6.4" -> "46.19.2"
01:00:52.020 STDOUT tofu:         # (26 unchanged attributes hidden)
01:00:52.020 STDOUT tofu:     }
01:00:52.020 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:00:52.020 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Frenovate%252Fterragrunt_kubernetes_renovate)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/renovate -w terragrunt_kubernetes_renovate
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```